<!--const：用于声明常量。注意：定义的变量的时候，必须同时初始化，且其值之后不可以修改。-->
<!--var：最常用的声明变量关键字。定义的变量的时候，若没有初始化，不报错，会输出undefined。其值之后可以修改。-->
<!--var可以用来声明全局变量，也可以声明局部变量，依据它们声明的位置：-->
<!--全局变量：在函数外定义的变量；（注意：若没有使用关键字声明的变量，默认为全局变量。）作用域是整个代码文件。-->
<!--局部变量：在函数内定义的变量。作用域是当前的函数内部。-->
<!--let：块级作用域 。在块级{}里面用let定义的变量，离开当前的块{}之后，就不能使用（有点像局部变量，但作用域不一样）。-->
<!--注意：{...}一对花括弧就就是一个特定的代码块，包括直接的{}，流程语句的{}，函数的{},....。函数声明时本身就带有{}，也是属于一个代码块。-->

<!--var let const-->
<!--1.var 是es5语法,let const es6语法-->
<!--2.const定义常量-->
<!--3.var 有变量提升-->
<!--4.let const 有块级作用域 var 没有-->
<!--5.作用于有全局作用域，函数作用域，块级作用域。-->
